Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_2 (Dense)              (None, 4096)              413696    
_________________________________________________________________
reshape_1 (Reshape)          (None, 4, 4, 256)         0         
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_5 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 256)       590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_6 (Activation)    (None, 16, 16, 256)       0         
_________________________________________________________________
up_sampling2d_6 (UpSampling2 (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_10 (Batc (None, 32, 32, 128)       512       
_________________________________________________________________
activation_7 (Activation)    (None, 32, 32, 128)       0         
_________________________________________________________________
up_sampling2d_7 (UpSampling2 (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 64, 64, 128)       147584    
_________________________________________________________________
batch_normalization_11 (Batc (None, 64, 64, 128)       512       
_________________________________________________________________
activation_8 (Activation)    (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 64, 64, 3)         3459      
_________________________________________________________________
activation_9 (Activation)    (None, 64, 64, 3)         0         
=================================================================
Total params: 2,043,011
Trainable params: 2,041,475
Non-trainable params: 1,536
_________________________________________________________________
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 16, 64)        18496     
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 17, 17, 64)        0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 17, 17, 64)        256       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 17, 17, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 17, 17, 64)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 9, 9, 128)         73856     
_________________________________________________________________
batch_normalization_13 (Batc (None, 9, 9, 128)         512       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 9, 9, 128)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 9, 9, 128)         0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 9, 9, 256)         295168    
_________________________________________________________________
batch_normalization_14 (Batc (None, 9, 9, 256)         1024      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 9, 9, 256)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 9, 9, 256)         0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 9, 9, 512)         1180160   
_________________________________________________________________
batch_normalization_15 (Batc (None, 9, 9, 512)         2048      
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 9, 9, 512)         0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 9, 9, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 41472)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 41473     
=================================================================
Total params: 1,613,889
Trainable params: 1,611,969
Non-trainable params: 1,920